tap "homebrew/bundle"
tap "homebrew/services"
tap "hashicorp/tap"
tap "fluxcd/tap"
tap "knative/client"

# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"

## Cloud Toolkit
# The Azure command-line interface (Azure CLI)
brew "azure-cli"
# Kind os a tool for running local Kubernetes clusters using Docker container “nodes”.
brew "kind"
# Kubernetes CLI
brew "kubectl"
# Knative is an Open-Source Enterprise-level solution to build Serverless and Event Driven epplications
brew "knative/client/kn"
# Kubernetes package manager
brew "helm"
# Terraform
brew "terraform"
# Terragrunt
brew "terragrunt"
# Generate Terraform modules documentation in various formats
brew "terraform-docs"
# tfsec is a static analysis security scanner for your Terraform code.
brew "tfsec"
# Fluxcd
brew "flux"

## Dev Toolkit
# Open source programming language to build simple/reliable/efficient software
brew "go@1.22"
# Go linters aggregator
brew "golangci-lint"
# Development kit for the Java programming language
brew "openjdk@11"
# JavaScript package manager
brew "yarn"
# Platform built on V8 to build network applications
brew "node"
# A CLI tool and Go library for generating a Software Bill of Materials (SBOM) from container images and filesystems
brew "syft"

# Improved top (interactive process viewer)
brew "htop"
# NCurses Disk Usage
brew "ncdu"
# Implementation of the OpenAL 3D audio API
brew "openal-soft"
# Protocol buffers (Google's data interchange format)
brew "protobuf"

# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
