tap "ethereum/ethereum"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "knative/client"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Official GitLab CI runner
brew "gitlab-runner"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Vorbis General Audio Compression Codec
brew "libvorbis"
# Command-line based markdown presentation tool
brew "mdp"
# Run a Kubernetes cluster locally
brew "minikube"
# NCurses Disk Usage
brew "ncdu"
# Implementation of the OpenAL 3D audio API
brew "openal-soft"
# Cross-platform library for audio I/O
brew "portaudio"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# File browser
brew "ranger"
# JavaScript package manager
brew "yarn"
brew "knative/client/kn"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
